Network(
  (model): Sequential(
    (0): Linear(in_features=1708, out_features=2048, bias=True)
    (1): ReLU()
    (2): Linear(in_features=2048, out_features=2048, bias=True)
    (3): ReLU()
    (4): Linear(in_features=2048, out_features=2048, bias=True)
    (5): ReLU()
    (6): Linear(in_features=2048, out_features=512, bias=True)
    (7): ReLU()
    (8): Linear(in_features=512, out_features=42, bias=True)
  )
)